my-emacs-config/init.el
;; -*- lexical-binding: t; -*-
(setq gc-cons-threshold (* 50 1000 1000))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(defun my/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "emacs-config.org" user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

(defvar bootstrap-version)
;; 修复 Emacs 29 修改了 native-compile 相关变量导致的 bug
(unless (version<= emacs-version "28.2")
  (setq straight-repository-branch "develop"))
(setq straight-check-for-modifications '(check-on-save find-when-checking))

(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package) ; 安装 use-package, 版本29后内置
(setq straight-use-package-by-default t) ; 自动安装所有插件, 相当于加入 :straight t
;; 如果不使用 straight, 上面一行相当于:
;; (setq use-package-always-ensure t) ; 相当于加入 :ensure t

(server-start)

(use-package no-littering
  :custom
  (auto-save-file-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))) ; 设置自动保存文件目录

(use-package recentf
  :after no-littering
  :custom
  (recentf-exclude '(no-littering-var-directory
                     no-littering-etc-directory)) ; 屏蔽临时文件
  (recentf-max-menu-items 25)
  (recentf-max-saved-items 25)
  :bind ("C-x C-r" . 'recentf-open-files)
  :config
  (recentf-mode 1))

;; Emacs 29 启用了新变量名
(if (version<= emacs-version "28.2")
    (setq native-comp-deferred-compilation-deny-list '(".*pdf.*")) ; 禁用 =pdf-tools= 有关文件的本地化编译
  (setq native-comp-jit-deferred-compilation-deny-list '(".*pdf.*"))) ; 禁用 =pdf-tools= 有关文件的本地化编译

;; (setq warning-minimum-level :error) ; 不提示 warning

(setq-default major-mode 'text-mode)

;; 默认在 Windows 系统下使用图形界面
(setq my/is-windows t
      my/is-linux nil
      my/is-terminal nil
      my/is-tablet nil
      my/is-VM nil
      my/exwm-enabled nil
      my/mu4e-enabled nil)

(setq my/is-windows (eq system-type 'windows-nt)) ; Windows 系统
(setq my/is-linux (eq system-type 'gnu/linux)) ; Linux 系统

(setq my/is-terminal (not window-system)) ; 图形界面
(setq my/is-tablet (and my/is-linux my/is-terminal)) ; 平板上的 termux 终端

;; borrow the idea from https://github.com/daviwil/dotfiles/blob/master/Emacs.org
(setq my/exwm-enabled (and my/is-linux
                           (seq-contains command-line-args "--use-exwm")
                           (eq window-system 'x)))

(setq my/mu4e-enabled
 (or (string= (system-name) "ubuntu22")
  (string= (system-name) "DESKTOP-FR25R6P")))

(use-package savehist
  :defer 2
  :config (savehist-mode))

(use-package saveplace
  :defer 2
  :config
  (save-place-mode 1))

(use-package super-save
  :defer 2
  :custom
  (super-save-auto-save-when-idle t)
  :config
  (super-save-mode +1))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers nil)

(prefer-coding-system 'utf-8) ; 默认编码
(setq-default buffer-file-coding-system 'utf-8-unix) ; 默认 EOL 设置

(if my/is-VM ; EXWM 启动时不能获取正确的分辨率
    (setq my/font-height 170
          my/latex-preview-scale 1.7)
  (pcase (display-pixel-height)
    ((pred (> 999))
     (setq my/font-height 130
           my/latex-preview-scale 1.3))
    ((pred (> 1300))
     (setq my/font-height 155
           my/latex-preview-scale 1.55))
    (_ (setq my/font-height 180
             my/latex-preview-scale 1.8))))

;; Ubuntu 下字体安装: sudo apt install fonts-firacode fonts-jetbrains-mono fonts-cmu fonts-archic-gkai00mp
(cond (my/is-windows
       (setq my/math-font "Cambria Math" ; 数学符号字体
             my/chinese-font "Kaiti") ; 中文字体
       (set-face-attribute 'variable-pitch nil :font "Segoe Print" :height my/font-height :weight 'regular)) ; 比例字体
      (my/is-linux 
       (setq 
        my/math-font "Latin Modern Math" ; 在 WSL2 下需要从 TeXlive 下安装
        my/chinese-font "AR PL KaitiM GB")
       (set-face-attribute 'variable-pitch nil :font "Segoe Print" :height my/font-height :weight 'regular))) ; 非 Windows 系统需要下载 Segoe Print (有替代品吗?)

(set-face-attribute 'default nil :font "Fira Code" :height my/font-height) ; 默认字体及字号.
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono"  :height my/font-height) ; 等宽字体

(unless my/is-terminal ; terminal 下以下变量不可用
  (set-fontset-font "fontset-default" 'mathematical my/math-font) ; 数学符号默认字体
  (set-fontset-font "fontset-default" 'han my/chinese-font)) ; 中文默认字体
(setq inhibit-compacting-font-caches t) ; 汉字及 Unicode 显示问题
(setq auto-window-vscroll nil) ; 不根据行高做上下滚动调整; 可以加快在 Windows (甚至是虚拟机) 上的速度.

(defun my/pyim-probe-latex-mode ()
 "latex-mode 中的数学环境自动切换到英文输入."
 (and (eq major-mode 'latex-mode)
      (if (fboundp 'texmathp) (texmathp) nil)))

(use-package popup :defer t) ; 选词框
(use-package pyim-wbdict :defer 2) ; 五笔输入法
(use-package pyim 
  :defer 2
  :after pyim-wbdict
  :bind
  ("M-j" . 'pyim-convert-string-at-point)
  :config
  (setq default-input-method "pyim")
  (setq pyim-default-scheme 'wubi)
  (pyim-wbdict-v86-enable)
  (require 'popup)
  (setq pyim-page-tooltip '(minibuffer)) ; 需要候选框可以使用 popup, 但是会影响速度
  (setq-default pyim-punctuation-translate-p '(no)); 总是输入半角标点. 
  (setq-default pyim-english-input-switch-functions
              '(pyim-probe-auto-english
                pyim-probe-isearch-mode
                pyim-probe-program-mode
                pyim-probe-org-structure-template
                pyim-probe-org-latex-mode
                my/pyim-probe-latex-mode))
  (setq-default pyim-punctuation-half-width-functions
              '(pyim-probe-punctuation-line-beginning
                pyim-probe-punctuation-after-punctuation)))
