my-emacs-config/emacs-config.org
*** 试用新主题的函数
参考 https://www.reddit.com/r/emacs/comments/ezetx0/doomthemes_screenshots_updated_good_time_to_go/
#+begin_src elisp
(defun my/load-doom-theme (theme)
  "Disable active themes and load a Doom theme."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name)
                                                   (--select (string-prefix-p "doom-" it)))))))
  (ap/switch-theme theme)
  (set-face-foreground 'org-indent (face-background 'default)))

(defun my/switch-theme (theme)
  "Disable active themes and load THEME."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name))))))
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme theme 'no-confirm))
#+end_src
*** Doom 主题
#+begin_src elisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-moonlight t) ; 当前主题
    (doom-themes-visual-bell-config) ; Enable flashing mode-line on errors
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;;  (doom-themes-neotree-config)
    ;; or for treemacs users
    ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    ;;(doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src

*** Modus-theme 设置 (未使用)
Use ~modus-theme~ for high contrast
- mode line: highlight active mode line, hide the border
- set the background for marked region
- set the background in the completion minibuffer
- set the foreground for ~comment~ and ~string~
- set background for matched parenthesis.
- The flatting list ~:@modus-themes-preset-overrides-intense~ has to be after loading the package to work properly.
- It is also possible to use ~(setq modus-themes-variable-pitch-ui t)~ to make the UI use variable pitch font
#+begin_src elisp
  ;; (use-package modus-themes)
  ;; (setq modus-themes-common-palette-overrides
  ;;       `((bg-mode-line-active bg-red-subtle) 
  ;;         (fg-mode-line-active red-warmer)
  ;;         (border-mode-line-active unspecified) 
  ;;         (border-mode-line-inactive unspecified)
  ;;         (bg-region bg-lavender) 
  ;;         (fg-region unspecified)
  ;;         (fg-completion-match-0 fg-main)
  ;;         (fg-completion-match-1 fg-main)
  ;;         (fg-completion-match-2 fg-main)
  ;;         (fg-completion-match-3 fg-main)
  ;;         (bg-completion-match-0 bg-blue-intense)
  ;;         (bg-completion-match-1 bg-yellow-intense) 
  ;;         (bg-completion-match-2 bg-cyan-intense)
  ;;         (bg-completion-match-3 bg-red-intense)
  ;;         (comment yellow-cooler)
  ;;         (string green-cooler)
  ;;         (bg-paren-match bg-magenta-intense)
  ;;         ,@modus-themes-preset-overrides-intense))
#+end_src
- more bold and italic construct
- used highlighted org-block
- Set font for headings in ~org-mode~
Other theme setting
#+begin_src elisp
  ;; (setq modus-themes-bold-construct t
  ;;       modus-themes-italic-construct t
  ;;       modus-themes-org-blocks 'tinted-background
  ;;       modus-themes-scale-headings t
  ;;       modus-themes-headings
  ;;       '((1 . (rainbow overline background 1.3))
  ;;         (2 . (rainbow background 1.2))
  ;;         (3 . (rainbow bold 1.15))
  ;;         (t . (semilight 1.1))))
#+end_src
Load  theme at the last
#+begin_src elisp
  ;(load-theme 'modus-vivendi-tinted t)
#+end_src

** doom mode-line
#+begin_src elisp
  (use-package all-the-icons
    :if (display-graphic-p)) ; 第一次运行时, M-x all-the-icon-install-fonts 安装字体.
  (use-package minions
    :hook doom-modeline-mode)
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-unicode-fallback t)
    :config
    (setq doom-modeline-height 1) ; optional
    (custom-set-faces
     '(mode-line ((t (:height 0.85))))
     '(mode-line-active ((t (:height 0.85)))) ; For 29+
     '(mode-line-inactive ((t (:height 0.85))))))
#+end_src
** 行号, 列号与换行
这个要在 =doom-theme= 之后才能生效!
#+begin_src elisp
  (column-number-mode) ; 显示列号
  (visual-line-mode 1) ; 自动断行
  (global-display-line-numbers-mode t) ; 显示行号
    ;; 不显示行号的模式:
  (dolist (mode '(term-mode-hook
                  helpful-mode-hook
                  eshell-mode-hook
                  pdf-view-mode-hook
                  eww-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
  (setq display-line-numbers-type 'visual) ; 行号考虑自动断行
  ;; 行号强制用等宽字体
  (set-face-attribute 'line-number nil :inherit '(fixed-pitch)) 
  (set-face-attribute 'line-number-current-line nil :inherit '(fixed-pitch))
#+end_src
** 窗口外观
#+begin_src elisp
  (setq default-frame-alist '((fullscreen . maximized))) ; 全屏
  ;; (set-frame-parameter nil 'undecorated t)
  ;; (add-to-list 'default-frame-alist '(drag-internal-border . 1))
  ;; (add-to-list 'default-frame-alist '(internal-border-width . 5))
  (unless my/is-terminal ; 终端下以下设置不可用
    (tool-bar-mode -1) ; 禁用工具栏
    (scroll-bar-mode -1)) ; 禁用滚动条
  (menu-bar-mode -1) ; 禁用菜单栏
#+end_src
* 窗口管理
** 默认打开新窗口方式
#+begin_src elisp
  (setq split-height-threshold nil) ; 默认左右分屏
  (setq display-buffer-base-action
        '((display-buffer-reuse-window ; 针对 *eshell* 等重名 buffer
           display-buffer-reuse-mode-window ; 默认使用当前窗口的模式
           display-buffer-in-previous-window ; 在用过的窗口中打开
           display-buffer-same-window))) ; 在当前窗口中打开
#+end_src
** 弹出窗口管理 (=popper=)
#+begin_src elisp
  (setq my/right-popper-buffer-regexp "\\(\\*scratch\\|\\*draft\\|\\*help\\|\\*Message\\|\\*Customize\\)") ; 在右侧打开的临时窗口
  (setq my/bottom-popper-buffer-regexp "\\(\^\\*shell\\|\*compilation\\|\\*Backtrace\\|\\*Warnings\\|output\\*$\\)") ; 在下方打开的临时窗口

  (use-package popper
    :defer 3
    ;; 修正了 popper-echo.el 中一个 bug. 若不同时使用 echo-mode 与 group-function 也可以使用原有版本(删去下一行)
    :straight (:local-repo "../../lisp/popper/" :type nil) 
    :bind (("C-M-'" . popper-toggle-latest)
           ("M-'" .  popper-cycle)
           ("C-M-;" . popper-toggle-type)
           ;; 在 termux 中不能使用 C-', 在 EXWM 窗口中不能使用 C-M. 这里定义备用快捷键
           ("C-c p l" . popper-toggle-latest) 
           ("C-c p t" . popper-toggle-type) 
           ("C-c p c" . popper-cycle))
    :custom
    (popper-reference-buffers `(,my/bottom-popper-buffer-regexp ,my/right-popper-buffer-regexp))
    (popper-group-function #'popper-group-by-perspective) ; 用 perspective 分类弹出窗口
    (popper-display-control nil) ; 用 display-buffer-list 管理弹出窗口行为
    :config
    (popper-mode +1)
    (popper-echo-mode +1))
#+end_src
** 新窗口显示管理
设置 =display-buffer-alist= 变量
*** 弹出窗口管理与 =dsiplay-buffer-alist= 初始化
#+begin_src elisp
  (setq window-side-slots '(0 0 2 2)) ; 左上右下最大临时窗口数
  (setq display-buffer-alist
        `((,my/bottom-popper-buffer-regexp ; 下侧打开的窗口
           (display-buffer-in-previous-window display-buffer-reuse-mode-window display-buffer-in-side-window)
           (window-height . 0.2)
           (window-min-height . 7)
           (side . bottom)
           (reusable-frames . visible))
          (,my/right-popper-buffer-regexp ; 右侧打开的窗口
           (display-buffer-reuse-mode-window display-buffer-in-side-window)
           (reusable-frames . visible)
           (side . right)
           (direction . rightmost)
           (window-width . 0.33))))
 #+end_src
*** LaTeX 相关窗口管理 (=pdf= 与 =tex=)
#+begin_src elisp
  (add-to-list 'display-buffer-alist '(".*pdf$" ; 默认右侧打开 pdf
                                       (display-buffer-in-direction
                                        display-buffer-in-previous-window)
                                       (direction . rightmost)))
  (add-to-list 'display-buffer-alist '(".*tex$" (display-buffer-in-previous-window))) ; 默认在原来的窗口中打开 tex 文件
#+end_src
*** =org-roam= 相关窗口管理
#+begin_src elisp
  ;; org-roam 默认在右侧打开
  (add-to-list 'display-buffer-alist
               '("\\*org-roam\\*"
                 (display-buffer-in-direction)
                 (direction . right)
                 (window-width . 0.33)
                 (window-height . fit-window-to-buffer)))
#+end_src
*** =org-capture= 相关窗口管理
#+begin_src elisp
  ;; org-roam capture 与 *Org-Select* 默认右侧打开
  (add-to-list 'display-buffer-alist '("\\(^CAPTURE.*\.org$\\|\\*Org.*Select\\*$\\)"
                                       (display-buffer-in-side-window)
                                       (side . right)
                                       (slot . 0)
                                       (window-width . 60)))
#+end_src
