my-emacs-config/emacs-config.org
** 快速窗口切换
#+begin_src elisp
  (use-package ace-window
    :defer 2
    :bind ("M-o" . ace-window)
    :custom
    (aw-scope 'global)
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :config
    (ace-window-display-mode 1))
#+end_src
** 窗口布局历史记录 (=Winner mode=)
#+begin_src elisp
  (use-package winner
    :defer 2
    :config
    (winner-mode))
#+end_src

* 补全 (minibuffer)
** Vertico
#+begin_src elisp
  (defun my/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
    folder, otherwise delete a word"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
      (delete-word (- arg))))
  (setq completion-ignore-case 't) ; minibuffer 补全忽略大小写
  (use-package vertico
    :defer 1
    :custom
    (verticle-cycle t)
    :config
    (vertico-mode)
    :bind (:map minibuffer-local-map
                ("M-h" .  my/minibuffer-backward-kill)))
#+end_src
** 额外补全信息 (Marginalia)
#+begin_src elisp
  (use-package marginalia
    ;; Either bind `marginalia-cycle' globally or only in the minibuffer
    :bind (("M-A" . marginalia-cycle)
           :map minibuffer-local-map
           ("M-A" . marginalia-cycle))
    :defer 1
    :config
    (marginalia-mode))
#+end_src
** 乱序补全 (Orderless)
#+begin_src elisp
  (use-package orderless
    :defer 1
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src
* 帮助信息优化
** 快捷键提示 (which-key)
#+begin_src elisp
  (use-package which-key
    :defer 2
    :custom (which-key-idle-delay 1)
    :config (which-key-mode))
#+end_src
** 帮助界面优化 (helpful)
#+begin_src elisp
  (use-package helpful
    :defer 3
    :bind ; 这里更好的选择可能是用 [remap]
    (([remap describe-function] . #'helpful-callable)
     ([remap describe-variable] . #'helpful-variable)
     ([remap describe-key] . #'helpful-key)
     ([remap describe-command] . #'helpful-command)
     ([remap describe-symbol] . #'helpful-symbol)
     ("C-h C-d" . #'helpful-at-point)
     ("C-h F" . #'helpful-function))
    :config
    (add-hook 'helpful-mode-hook 'visual-line-mode)) ; 侧窗显示的帮助界面需要自动换行
#+end_src
** 当前按键显示 (keycast)
#+begin_src elisp
  (use-package keycast
    :after doom-modeline
    :config 
    (if (not my/exwm-enabled)
        (keycast-header-line-mode 1) ; 默认在 header 显示
      (keycast-mode-line-mode 1)
      (setq keycast-mode-line-insert-after '(:eval (doom-modeline-format--main))))) ; 与 Doom mode-line 配合需要额外设置, 但这里只是为了在 EWXM 中让 polybar 读取 keycast 的信息, 不需要真的打开 keycast-mode
#+end_src
* 文本编辑
** 彩色括号 (=rainbow-delimiters=)
#+begin_src elisp
  (use-package rainbow-delimiters
    :hook prog-mode) ; 在编程模式中启用
#+end_src
** prettify 设置
#+begin_src elisp
(setq prettify-symbols-unprettify-at-point t) ; 光标附近自动展开
#+end_src
** 文本补全 (company mode)
#+begin_src elisp
  (use-package company
    :defer t
    :hook (org-mode LaTeX-mode prog-mode) ; 加载 company 的主模式
    :custom
    (company-minimum-prefix-length 3)
    (company-idle-delay 0.3)
    (company-tootip-idle-delay 0.5)
    (company-tooltip-offset-display 'line)
    (company-tooltip-align-annotation t)
    (company-show-quick-access t)
    (company-backends
     '((company-capf :with company-dabbrev-code company-keywords)
       (company-dabbrev)
       (company-ispell)
       (company-files)))
    (company-dabbrev-ignore-case 'keep-prefix)
    (company-transformers '(company-sort-by-occurrence company-sort-by-backend-importance))
    (company-show-quick-access 'left)
    :bind
    (:map company-active-map 
          ("M-/" . company-complete)
          ("<tab>" . company-indent-or-complete-common))
    :config
    (set-face-attribute 'company-tooltip nil :inherit 'fixed-pitch))
#+end_src

* Vim 快捷键 (evil)
#+begin_src elisp
  (use-package key-chord
    :custom
    (key-chord-two-keys-delay 0.5) ; 在 evil 模式中可以用 "jk" 切换到普通模式
    :config
    (key-chord-mode 1))

  (use-package evil
    :defer 2
    :after key-chord
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil) ; 使用 evil-collection 的快捷键
    (setq evil-respect-visual-line-mode t) ; j/k 键考虑 visual line
    :config
    (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
** evil-org
在 =org= 模式中使用 =evil=
#+begin_src elisp
(use-package evil-org
  :after org
  :hook org-mode 
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src
* 拼写检查
** =flyspell=
需要安装 =aspell= 或 =hunspell=. =Windows= 可通过 =msys2= 安装 =libenchant= 及相关字典
#+begin_src elisp
  (use-package flyspell
  :if my/is-windows
  :hook (LaTeX-mode org-mode)
    :init
    (setq ispell-program-name "hunspell")
    (setenv "LANG" "en_US.UTF-8")
    (unless my/is-terminal
      (setq ispell-alternate-dictionary (expand-file-name "english-words.txt" user-emacs-directory))
      (setq ispell-complete-word-dict (expand-file-name "english-words.txt" user-emacs-directory))) ; 拼写补全字典
    (setq ispell-personal-dictionary (expand-file-name ".ispell" user-emacs-directory))) ; 默认个人字典

#+end_src
** Jinx
https://github.com/minad/jinx
#+begin_src elisp
  (unless my/is-windows ; windows 下 jinx 无法编译
    (use-package jinx
      :hook (emacs-startup . global-jinx-mode)
      :bind ([remap ispell-word] . jinx-correct)
      :config 
      (add-to-list 'jinx-exclude-regexps '(t "\\cc"))) ; 拼写检查忽略中文
    )
#+end_src

* 其它设置
** Hydra
#+begin_src elisp
  (use-package hydra
    :defer 5)
#+end_src

** 临时文件目录
防止 =Windows= 用 =<user name>~1= 命名家目录, 修复一个 =preview-latex= 的 bug
#+begin_src elisp
  (if (eq system-type 'windows-nt)
    (setq temporary-file-directory "~/AppData/Local/Temp/"))
#+end_src
** 安全的文件变量
#+begin_src elisp
  (setq safe-local-variable-values
        '((code . utf-8)
          (eval setq-local org-roam-db-location (file-truename "./org-roam.db")) ; 允许多个 org-roam 目录
          (eval setq-local org-roam-directory (file-truename "./"))))
#+end_src
* LaTeX 设置
** cdlatex
*** cdlatex 自定义变量
