my-emacs-config/emacs-config.org
**** 补全命令模板
#+begin_src elisp
  (defun my/set-cdlatex-command-alist ()
      (setq cdlatex-command-alist
            '(("eq" "insert pairs of \\[ \\]" "\\[ ? \\]" cdlatex-position-cursor nil t t)
              ("exe" "Insert exercise" "\\begin{exercise}\n? \n\\end{exercise}" cdlatex-position-cursor nil t nil)
              ("ons" "" "\\onslide<?>{ }" cdlatex-position-cursor nil t t)
              ("prop" "insert proposition" "" cdlatex-environment ("proposition") t nil)
              ("aali" "insert equation" "\\left\\{\\begin{aligned}\n? \n\\end{aligned}\\right." cdlatex-position-cursor nil nil t)
              ("te" "insert text" "\\text{?}" cdlatex-position-cursor nil nil t)
              ("st" "stackrel" "\\stackrel{?}{}" cdlatex-position-cursor nil nil t)
              ("fra" "insert frame (for beamer)" "" cdlatex-environment ("frame") t nil)
              ("lr<" "insert bra-ket" "\\langle ? \\rangle" cdlatex-position-cursor nil nil t)
              ("spl" "insert split" "" cdlatex-environment ("split") nil t)
              ("equ*" "insert unlabel equation" "" cdlatex-environment ("equation*") t nil)
              ("ipite" "insert in paragraph itemize" "" cdlatex-environment ("inparaitem") t nil)
              ("ipenu" "insert in paragraph enumerate" "" cdlatex-environment ("inparaenum") t nil)
              ("des" "insert description" "" cdlatex-environment ("description") t nil)
              ("lem" "insert lemma env" "" cdlatex-environment ("lemma") t nil)
              ("thm" "insert theorem env" "" cdlatex-environment ("theorem") t nil)
              ("pro" "insert proof env" "" cdlatex-environment ("proof") t nil)
              ("def" "insert definition env" "" cdlatex-environment ("definition") t nil)
              ("liml" "insert \\lim\\limits_{}" "\\lim\\limits_{?}" cdlatex-position-cursor nil nil t)
              ("prodl" "insert \\prod\\limits_{}^{}" " \\prod\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
              ("cupl" "insert \\bigcup\\limits_{}^{}" "\\bigcup\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
              ("capl" "insert \\bigcap\\limits_{}^{}" "\\bigcap\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
              ("big(" "insert big ()" "\\big( ? \\big" cdlatex-position-cursor nil nil t)
              ("Big(" "insert Big ()" "\\Big( ? \\Big" cdlatex-position-cursor nil nil t)
              ("bigg(" "insert bigg()" "\\bigg( ? \\bigg" cdlatex-position-cursor nil nil t)
              ("big|" "insert big|" "\\big| ? \\big|" cdlatex-position-cursor nil nil t)
              ("Big|" "insert Big|" "\\Big| ? \\Big|" cdlatex-position-cursor nil nil t)
              ("bigg|" "insert bigg|" "\\bigg| ? \\bigg|" cdlatex-position-cursor nil nil t)
              ("Big\\|" "insert Big \\|" "\\Big\\| ? \\Big\\|" cdlatex-position-cursor nil nil t)
              ("bigg\\|" "insert bigg\\|" "\\bigg\\| ? \\bigg\\|" cdlatex-position-cursor nil nil t)
              ("case" "insert cases" "\\begin{cases}\n? & \\\\\n &\n\\end{cases}" cdlatex-position-cursor nil nil t)
              ("big\\|" "insert big \\|" "\\big\\| ? \\big\\|" cdlatex-position-cursor nil nil t)
              ("se" "insert \\{\\}" "\\{ ? \\}" cdlatex-position-cursor nil nil t)
              ("big{" "insert big {}" "\\big\\{ ? \\big\\" cdlatex-position-cursor nil nil t)
              ("big[" "insert big []" "\\big[ ? \\big" cdlatex-position-cursor nil nil t)
              ("Big{" "insert Big{}" "\\Big\\{ ? \\Big\\" cdlatex-position-cursor nil nil t)
              ("bigg{" "insert bigg{}" "\\bigg\\{ ? \\bigg\\" cdlatex-position-cursor nil nil t)
              ("Big[" "insert Big[" "\\Big[ ? \\Big" cdlatex-position-cursor nil nil t)
              ("bigg[" "insert bigg[" "\\bigg[ ? \\bigg" cdlatex-position-cursor nil nil t)
              ("pa" "insert pause" "\\pause" ignore nil t nil)
              ("enu*" "insert enu" "\\begin{enumerate}\n\\item ?\n\\end{enumerate}" cdlatex-position-cursor nil t nil)
              ("it" "insert \\item" "\\item?" cdlatex-position-cursor nil t nil))))
#+end_src
**** 环境模板
#+begin_src elisp 
  (defun my/set-cdlatex-env-alist ()
      (setq cdlatex-env-alist
            '(("equation*" "\\begin{equation*}\n? \n\\end{equation*}" nil)
              ("frame" "\\begin{frame}\n\\frametitle{?}\n\n\\end{frame}" nil)
              ("inparaitem" "\\begin{inparaitem}\n\\item ?\n\\end{inparaitem}" "\\item ?")
              ("enumerate" "\\begin{enumerate}[?]\n\\item \n\\end{enumerate}" "\\item ?")
              ("inparaenum" "\\begin{inparaenum}\n\\item ? \n\\end{inparaenum}" "\\item ?")
              ("theorem" "\\begin{theorem}\n\\label{thm:?}\n\n\\end{theorem}" nil)
              ("lemma" "\\begin{lemma}\n\\label{lem:?}\n\n\\end{lemma}" nil)
              ("proof" "\\begin{proof}?\n\n\\end{proof}" nil)
              ("definition" "\\begin{definition}\n\\label{def:?}\n\n\\end{definition}" nil)
              ("proposition" "\\begin{proposition}\n\n\\end{proposition}" nil)
              ("exercise" "\\begin{exercise}[?]\n\n\\end{exercise}" nil))))
#+end_src
**** 数学字体修饰设置
#+begin_src elisp
  (defun my/set-cdlatex-math-modify-alist ()
      (setq cdlatex-math-modify-alist
            '((?t "\\mathbb" "" t nil nil))))
#+end_src
**** 数学符号
#+begin_src elisp
  (defun my/set-cdlatex-math-symbol-alist ()
        (setq cdlatex-math-symbol-alist
              '((?0 ("\\varnothing" "\\emptyset"))
                (?1 ("\\ONE" "\\one"))
                (?. ("\\cdot" "\\circ"))
                (?v ("\\vee" "\\bigvee"))
                (?& ("\\wedge" "\\bigwedge"))
                (?9 ("\\cap" "\\bigcap"))
                (?+ ("\\cup" "\\bigcup"))
                (?- ("\\rightharpoonup" "\\hookrightarrow" "\\circlearrowleft"))
                (?= ("\\equiv" "\\Leftrightarrow" "\\Longleftrightarrow"))
                (?~ ("\\sim" "\\approx" "\\propto"))
                (?7 ("\\otimes" "\\bigotimes"))
                (?6 ("\\oplus" "\\bigoplus"))
                (?L ("\\Lambda" "\\lim_{?}^{}" "\\lim\\limits_{?}^{}"))
                (?* ("\\times" "\\prod"))
                (?e ("\\eps" "\\epsilon" "\\exp\\Big( ? \\Big)"))
                (?> ("\\mapsto" "\\longrightarrow" "\\rightrightarrows"))
                (?< ("\\preceq" "\\leftarrow" "\\longleftarrow"))
                (?| ("\\parallel" "\\perp"))
                (?S ("\\Sigma" "\\sum_{?}^{}"))
                (?{ ("\\subset" "\\subseteq"))
                (?} ("\\supset" "\\supseteq")))))
 #+end_src
*** use-package 模块 
#+begin_src elisp
  (use-package cdlatex
    :straight (:host github :repo "cdominik/cdlatex" )
    :defer 6
    :config ; 导入 cdlatex 自定义设置
    (setq cdlatex-paired-parens "$[{(")
    (my/set-cdlatex-math-symbol-alist)
    (my/set-cdlatex-math-modify-alist)
    (my/set-cdlatex-env-alist)
    (my/set-cdlatex-command-alist))
#+end_src
** LaTeX 编辑
主要使用 AucTeX 及配套插件
*** AucTeX 变量设置
**** 环境折叠
#+begin_src elisp
  (defun my/TeX-fold-config ()
    (setq TeX-fold-type-list '(env macro comment)
          TeX-fold-env-spec-list '(("[comment]" ("comment")) ("[proof]" ("proof")))
          LaTeX-fold-env-spec-list '(("frame" ("frame")))
          TeX-fold-macro-spec-list
          '(("[f]" ("footnote" "marginpar"))
            ("[c]" ("cite"))
            ("[l]" ("label"))
            ("[r]" ("ref" "pageref" "eqref"))
            ("[i]" ("index" "glossary"))
            ("[1]:||*" ("item"))
            ("..." ("dots"))
            ("(C)" ("copyright"))
            ("(R)" ("textregistered"))
            ("TM" ("texttrademark"))
            (1 ("emph" "textit" "textsl" "textmd" "textrm" "textsf" "texttt" "textbf" "textsc" "textup")))))
#+end_src
