my-emacs-config/init.el

(defun my/TeX-fonts-config ()
  (setq LaTeX-font-list
        '((?m "\\textmc{" "}" "\\mathmc{" "}")
          (?g "\\textgt{" "}" "\\mathgt{" "}")
          (?e "\\en{" "}")
          (?c "\\cn{" "}")
          (?4 "$" "$")
          (1 "" "" "\\mathcal{" "}")
          (2 "\\textbf{" "}" "\\mathbf{" "}")
          (3 "\\textsc{" "}")
          (5 "\\emph{" "}")
          (6 "\\textsf{" "}" "\\mathsf{" "}")
          (9 "\\textit{" "}" "\\mathit{" "}")
          (12 "\\textulc{" "}")
          (13 "\\textmd{" "}")
          (14 "\\textnormal{" "}" "\\mathnormal{" "}")
          (18 "\\textrm{" "}" "\\mathrm{" "}")
          (19 "\\textsl{" "}" "\\mathbb{" "}")
          (20 "\\texttt{" "}" "\\mathtt{" "}")
          (21 "\\textup{" "}")
          (23 "\\textsw{" "}")
          (4 "" "" t))))

(defun my/preview-latex-config ()
  (setq preview-default-option-list
        '("displaymath" "floats" "graphics" "textmath" "footnotes") ; 执行预览的环境
        preview-preserve-counters t ; 保留数学公式编号
        preview-pdf-color-adjust-method 'compatible)) ; 预览图片使用Emacs主题背景色

(defun my/reftex-config ()
  (setq  reftex-label-alist ; 交叉引用的自定义类型
         '(("theorem" ?t "thm:" nil nil ("Theorem" "定理"))
           ("lemma" ?a "lem:" nil nil ("Lemma")))
         reftex-ref-macro-prompt nil ; ~cte<tab>~ 后不提示类型
         reftex-ref-style-default-list '("Default"))) ; 默认引用风格

(require 'tex-mode) ; 载入 tex--prettify-symbols-alist 变量
(defun my/more-prettified-symbols ()
  (mapc (lambda (pair) (delete pair tex--prettify-symbols-alist))
        '(("\\supset" . 8835)))
  (mapc (lambda (pair) (cl-pushnew pair tex--prettify-symbols-alist))
        '(("\\big(" . #x2987) ; Z Notation left image bracket
          ("\\big)" . #x2988)
          ("\\Big(" . #x2985) ; left white parenthesis
          ("\\Big)" . #x2986)
          ("\\bigg(" . #xFF5F) ; full width left white parenthesis
          ("\\bigg)" . #xFF60)
          ("\\big[" . #x3010) ; full width left square bracket
          ("\\big]" . #x3011)
          ("\\Big[" . #x27E6) ; math left white square bracket
          ("\\Big]" . #x27E7)
          ("\\bigg[" . #x301A) ; left white square bracket
          ("\\bigg]" . #x301B)
          ("\\{" . #xFF5B) ; full width curly bracket
          ("\\}" . #xFF5D) 
          ("\\big\\{" . #xFF5B) ; 
          ("\\big\\}" . #xFF5D)
          ("\\Big\\{" . #xFF5B) ; white bracket
          ("\\Big\\}" . #xFF5D)
          ("\\bigg\\{" . #xFF5B) ; white bracket
          ("\\bigg\\}" . #xFF5D)
          ("\\Z" . 8484)
          ("\\Q" . 8474)
          ("\\N" . 8469)
          ("\\R" . 8477)
          ("\\eps" . 949)
          ("\\inf" . #x22C0) 
          ("\\sup". #x22C1)
          ("\\ONE" . #x1D7D9)
          ("\\mathbb{S}" . #x1D54A)
          ("\\PP" . #x2119)
          ("\\Ps" . #x1D5AF )
          ("\\Pp" . #x1D40F)
          ("\\E" . #x1D5A4)
          ("\\Ee" . #x1D404)
          ("\\EE" . #x1D53C )
          ("\\Fc" . #x2131)
          ("\\Nc" . #x1D4A9))))

(use-package outline
  :defer t
  :init
  (if my/is-windows
      (setq outline-minor-mode-prefix (kbd "C-o"))
    (setq outline-minor-mode-prefix (kbd "C-'")))
  :bind
  (:map outline-minor-mode-map
        ("C-' t" . outline-hide-body)
        ("C-' e" . outline-show-entry)
        ("C-' p" . outline-previous-visible-heading)
        ("C-' n" . outline-next-visible-heading)
        ("C-' a" . outline-show-all)))

(defun my/latex-hook ()
  (turn-on-cdlatex) 
  (turn-on-reftex) 
  (outline-minor-mode) ; 大纲预览
  (outline-hide-body) ; 启动时折叠文件
  (prettify-symbols-mode t)) ; prettify 数学符号

(use-package pdf-tools
      :straight (:host github :repo "vedang/pdf-tools"
                       :branch "feature/emacs-26.3" ; 不使用最新版
                       :build (:not native-compile)) ; 禁用本地化编译
  :mode ("\\.pdf\\'" . pdf-view-mode) ; pdf 文件默认打开方式
  :bind
  (:map pdf-view-mode-map
   ("d" . pdf-view-next-page-command)
   ("a" . pdf-view-previous-page-command)
   ("s" . pdf-view-scroll-up-or-next-page)
   ("w" . pdf-view-scroll-down-or-previous-page)
   :map pdf-history-minor-mode-map
   ("b" . pdf-history-backward)
   :map pdf-annot-minor-mode-map
   ("C-a a" . pdf-annot-add-highlight-markup-annotation)
   ("C-a s" . pdf-annot-add-squiggly-markup-annotation)
   ("C-a u" . pdf-annot-add-underline-markup-annotation)
   ("C-a d" . pdf-annot-delete))
  :custom
  (pdf-view-midnight-colors '("#000000" . "#9bCD9b")) ; 夜间模式设置绿色底色
  :config
  (require 'pdf-annot) ; 设置 pdf-annot-mimor-mode-map 必须
  (require 'pdf-history) ; 设置 pdf-history-minor-mode-map 必须
  (add-hook 'pdf-view-mode-hook 'pdf-view-fit-width-to-window) ; 默认适应页宽
  (add-hook 'pdf-view-mode-hook 'pdf-view-midnight-minor-mode) ; 默认夜间模式
  (pdf-tools-install))

(use-package tex
  :defer 8
  :straight auctex
  :custom
  (TeX-parse-self t) ; 自动解析 tex 文件found
  (TeX-PDF-mode t) 
  (TeX-DVI-via-PDFTeX t)
  ;; 正向与反向搜索设置
  (TeX-source-correlate-mode t)
  (TeX-source-correlate-method 'synctex)
  (TeX-view-program-selection '((output-pdf "PDF Tools"))) ; 使用 pdf-tools 预览 pdf
  (TeX-source-correlate-start-server t)
  :config
  ;; 设置 LaTeX 语法高亮颜色及字体大小
  (require 'font-latex)
  (set-face-attribute 'font-latex-math-face nil :foreground "#f78c6c" :font my/math-font :height 1.15) ; 数学符号
  (set-face-attribute 'font-latex-script-char-face nil :foreground "#c792ea") ; 上下标字符^与_
  (set-face-attribute 'font-latex-sedate-face nil :foreground "#ffcb6b") ; 关键字
  (setq-default TeX-master t) ; 默认询问主文件
  (add-hook 'LaTeX-mode-hook 'my/latex-hook) ; 加载LaTeX模式设置
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer) ; 编译后更新 pdf 文件
  (my/TeX-fold-config)
  (my/TeX-fonts-config)
  (my/preview-latex-config)
  (my/reftex-config)
  (my/more-prettified-symbols))

(use-package org-modern-indent
  :defer t
  :straight (:host github :repo "jdtsmith/org-modern-indent"))

(use-package org-modern
  :custom
  (org-modern-hide-stars nil) ; adds extra indentation
  (org-modern-table nil)
  (org-modern-list 
   '((?- . "•")
     (?* . "•")
     (?+ . "•")))
  :hook
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda)
  :config
  (add-hook 'org-mode-hook #'org-modern-indent-mode 90))

(use-package org-appear
  :hook org-mode
  :config 
  (setq org-hide-emphasis-markers t)) ; 默认隐藏标记, 如=,~,*,_ 等
