my-emacs-config/init.el

(defun my/setup-org-fonts ()
  (interactive)
  ;; 标题字体大小优化
  (set-face-attribute 'org-document-title nil :weight 'bold :height 1.2)
  (dolist (face '((org-level-1 . 1.05)
                  (org-level-2 . 1.0)
                  (org-level-3 . 1.0)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :weight 'medium :height (cdr face)))
  ;; org 字体美化
  (require 'org-faces)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil :foreground nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-block-end-line nil :foreground nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-property-value nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil  :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-drawer nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-document-info-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (setq org-fontify-quote-and-verse-blocks t) ; 启用 org-qoute 变量为 quote 设置不同的字体
  (set-face-attribute 'org-quote nil :inherit 'fixed-pitch)
  (require 'org-indent)
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch)))

(defun my/org-mode-visual-fill ()
(interactive)
  (setq visual-fill-column-width 150
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))
(use-package visual-fill-column
  :hook (org-mode . my/org-mode-visual-fill))

(defun my/org-view-latex ()
  (interactive)
  (setq org-format-latex-options
        `(:foreground default :background default :scale ,my/latex-preview-scale :html-foreground "Black" :html-background "Transparent" :html-scale 1.5 :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")) ; 公式预览设置
        ;; 以下为 LaTeX 语法高亮设置
        org-highlight-latex-and-related '(native latex entities)
        org-pretty-entities t
        org-pretty-entities-include-sub-superscripts nil))

(use-package org-fragtog
  ;; :hook (org-mode . org-fragtog-mode)
  :defer t)

;; 快速编译数学公式, 测试版
(use-package org-preview
  :straight (:host github :repo "karthink/org-preview")
  :hook (org-mode . org-preview-mode))

(defun my/org-tempo-setting ()
  (interactive)
  (require 'org-tempo) ; 保证 org-structure-template-alist 可用
  (setq org-structure-template-alist ; 用 org-tempo 快速插入代码块
        '(("el" . "src elisp")
          ("la" . "src latex")
          ("sh" . "src shell")
          ("a" . "export ascii")
          ("c" . "center")
          ("C" . "comment")
          ("e" . "example")
          ("E" . "export")
          ("h" . "export html")
          ("l" . "export latex")
          ("q" . "quote")
          ("s" . "src")
          ("v" . "verse"))))

(use-package org-download
  :defer t
  :custom
  (org-download-heading-lvl 1) ; 以一级标题作为图片文件夹
  :after org
  :bind (:map org-mode-map
              ("C-c i y" . org-download-yank)
              ("C-c i d" . org-download-delete)
              ("C-c i e" . org-download-edit))
  :config
  ;; 用文件名作为文件夹
  (defun my-org-download-method (link) 
    (let ((filename
           (file-name-nondirectory
            (car (url-path-and-query
                  (url-generic-parse-url link)))))
          (dirname (concat "./img/" (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))))
      (setq org-download-image-dir dirname)
      (make-directory dirname t)
      (expand-file-name (funcall org-download-file-format-function filename) dirname)))
  (setq org-download-method 'my-org-download-method)
  ;; 在 Windows 系统下修复过时的convert.exe; 注意: 用户名文件夹不能含有空格!
  (defun my/org-download-clipboard ()
    (interactive)
    (let ((filename (expand-file-name "screenshot.png" temporary-file-directory)))
      (shell-command-to-string (format "magick clipboard: %s" filename))
      (when (file-exists-p filename)
        (org-download-image filename)
        (delete-file filename))))
  ; 绑定剪贴板图片的快捷键
  (if my/is-windows
      (define-key org-mode-map (kbd "C-M-y") #'my/org-download-clipboard)
    (define-key org-mode-map (kbd "C-M-y") #'org-download-screenshot)))

(use-package valign
:if (display-graphic-p)
  :hook org-mode)

(defun my/follow-link-at-current-window () 
  (interactive)
  (let ((org-link-frame-setup (quote ((vm . vm-visit-folder-other-frame)
                                      (vm-imap . vm-visit-imap-folder-other-frame)
                                      (gnus . gnus)
                                      (file . find-file)
                                      (wl . wl-other-frame)))))

    (org-open-at-point)))
(defun my/follow-link-at-current-window-mouse (event)
  (interactive (list last-command-event))
  (posn-set-point (event-end event))
  (let ((org-link-frame-setup (quote ((vm . vm-visit-folder-other-frame)
                                      (vm-imap . vm-visit-imap-folder-other-frame)
                                      (gnus . gnus)
                                      (file . find-file)
                                      (wl . wl-other-frame)))))
    (org-open-at-point)))

(defun my/insert-inline-OCDL ()
  (interactive)
  (insert "\\(")
  (save-excursion (insert " \\)" )))
(defun my/insert-dollar-OCDL ()
  (interactive)
  (insert "$")
  (save-excursion (insert "$" )))
(defun my/insert-bra-OCDL ()
  (interactive)
  (insert "(")
  (save-excursion (insert ")" )))
(defun my/insert-sq-bra-OCDL ()
  (interactive)
  (insert "[")
  (save-excursion (insert "]" )))
(defun my/insert-curly-bra-OCDL ()
  (interactive)
  (insert "{")
  (save-excursion (insert "}" )))

(defun my-org-hook ()
  (org-indent-mode) ; 自动缩进
  (unless (< (display-pixel-height) 999) 
    (variable-pitch-mode 1)) ; 比例字体
  (org-cdlatex-mode) ; LaTeX 公式
  (visual-line-mode 1))

(use-package org
  :defer 10
  :custom
  (org-M-RET-may-split-line t)
  (org-startup-folded 'content) ; 开启时折叠大纲
  (org-ellipsis " ▾") ; 用小箭头代替...表示折叠
  (org-priority-lowest ?E) ; org-agenda 的优先级设为A-E
  (org-priority-default ?D) ; org-agenda 的默认优先级设为D
  :bind
  (:map org-mode-map
        ("C-c p" . nil) ; 用于 popper 快捷键
        ("C-c n" . nil) ; 用于 org-roam 快捷键
        ("C-c o" . my/follow-link-at-current-window) ; 在当前窗口打开 org 文件
        ("C-<down-mouse-1>" . my/follow-link-at-current-window-mouse) ; Ctrl+鼠标点击时, 在当前窗口打开 org 文件
        ("C-<drag-mouse-1>" . my/follow-link-at-current-window-mouse)
        :map org-cdlatex-mode-map ; 实现配对输入$, (, [, { 及 \( 与 \)
        ("$" . my/insert-dollar-OCDL)
        ("C-$" . my/insert-inline-OCDL)
        ("(" . my/insert-bra-OCDL)
        ("[" . my/insert-sq-bra-OCDL)
        ("{" . my/insert-curly-bra-OCDL))
  :config
  (my/setup-org-fonts)
  (my/org-view-latex)
  (my/org-tempo-setting) 
  (add-hook 'org-mode-hook 'my-org-hook))
