my-emacs-config/init.el

(use-package org-present
  :defer t
  :config
  (defun my/org-present-prepare-slide (buffer-name heading)
    (org-overview)  ; 仅显示顶层标题Show only top-level headlines
    (org-show-entry); 展开当前标题Unfold the current entry
    (org-show-children))   ; 显示当前子标题

  (defun my/org-present-start () ; 开始幻灯片的设置
    (turn-off-evil-mode)
    (setq visual-fill-column-width 110
          visual-fill-column-center-text t) ; 调整显示界面
    ;; 调整字体大小
    (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                       (header-line (:height 4.0) variable-pitch)
                                       (org-document-title (:height 1.75) org-document-title)
                                       (org-code (:height 1.55) org-code)
                                       (org-verbatim (:height 1.55) org-verbatim)
                                       (org-block (:height 1.25) org-block)
                                       (org-block-begin-line (:height 0.7) org-block)))
    (setq header-line-format " ") ; 在标题前加入空行
    (display-line-numbers-mode 0)
    (org-display-inline-images) ; 显示图片
    (read-only-mode 1)) ; 只读模式

  (defun my/org-present-end () ; 重置上述设置
    (setq-local face-remapping-alist 
                '((default variable-pitch default)))      
    (setq header-line-format nil) 
    (org-remove-inline-images)
    (org-present-small)
    (read-only-mode 0)
    (display-line-numbers-mode 1)
    (turn-on-evil-mode))


  (add-hook 'org-present-mode-hook 'my/org-present-start)
  (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
  (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide))

(use-package org-ref
  :defer t
  :bind (:map org-mode-map
              ("C-c (". org-ref-insert-label-link)
              ("C-c )". org-ref-insert-ref-link)))

(setq zot_bib '("~/Nutstore/1/Nutstore/Zotero-Library/Better BibTeX Export/My Library.bib"
                "~/Nutstore/1/Nutstore/Zotero-Library/Better BibTeX Export/My Library-desktop.bib") ; Zotero .bib 文件
      zot_pdf "~/Nutstore/1/Nutstore/Zotero-Library") ; Zotero 同步文件夹

(setq org_notes "~/repos/notes/ref/" ) ; org-roam 文献笔记目录
(setq my/daily-note-filename "%<%Y-%m-%d>.org" ; 日记默认文件名
      my/daily-note-header "#+title: %<%Y-%m-%d %a>\n#+SETUPFILE: ~/repos/notes/latex-preamble.org\n\n[[roam:%<%Y-%B>]]\n\n") ; 日记文件头

(use-package org-roam
  :defer 12
  :custom
  (org-roam-directory "~/repos/notes/") ; 默认笔记目录
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template ; 搜索节点信息显示
   (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-gc-threshold most-positive-fixnum)
  (org-roam-dailies-directory "daily/") ; 默认日记目录
  (org-roam-dailies-capture-templates ; 日记默认模板
   `(("d" "default" entry "* %?" ; 普通条目
      :target (file+head ,my/daily-note-filename
                         ,my/daily-note-header))
     ("t" "task" entry "* TODO %?\n  %U\n  %a\n  %i" ; 待办
      :if-new (file+head+olp ,my/daily-note-filename
                             ,my/daily-note-header
                             ("Tasks"))
      :empty-lines 1) 
     ("j" "journal" entry "* %<%I:%M %p> - Journal  :journal:\n\n%?\n\n" ; 研究日志
      :if-new (file+head+olp ,my/daily-note-filename
                             ,my/daily-note-header
                             ("Log")))
     ("m" "meeting" entry "* %<%I:%M %p> - Meeting with %^{whom}  :meetings:\n\n%?\n\n" 
      :if-new (file+head+olp ,my/daily-note-filename
                             ,my/daily-note-header
                             ("Meeting")))))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n c" . org-roam-capture)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n I" . org-roam-node-insert-immediate)
         ("C-c n t" . my/org-roam-capture-task)
         ("C-c n k" . orb-insert-link)
         ("C-c n a" . orb-note-actions)
         ("C-c n d" . my/org-roam-jump-menu/body)
         ("C-c n P" . my/org-roam-insert-new-project)
         ("C-c n p" . my/org-roam-find-project)
         ("C-c n u" . org-roam-ui-mode)
         ("C-c n j" . org-roam-dailies-capture-today)
         :map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (define-key org-roam-mode-map [mouse-1] (kbd "C-u <return>")) ; org-roam-buffer 界面左键相当于C-u <return>
  (setq org-roam-capture-templates  ; org-roam 笔记模板
        '(("d" "default" plain "- tag :: \n %?" ; 普及模板
           :target
           (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title} \n#+SETUPFILE: ./latex-preamble.org")
           :unnarrowed t)
          ("r" "bibliography reference in pdfs" plain ; 文献模板
           "#+FILETAGS: reading research \n - tags :: %^{keywords} \n* %^{title}
:PROPERTIES:\n:Custom_ID: %^{citekey}\n:URL: %^{url}\n:AUTHOR: %^{author-or-editor}\n:NOTER_DOCUMENT: ~/Nutstore/1/Nutstore/Zotero-Library/%^{citekey}.pdf\n:NOTER_PAGE:\n:END:"      
           :target
           (file+head "ref/${citekey}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n"))
          ("a" "article/post/blog/discussion" plain ; 其它阅读模板
           "#+FILETAGS: reading \n- tags :: \n- sources ::\n"      
           :target
           (file+head "article/%<%Y%m%d%H%M%S>-reading-${slug}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n"))
          ("s" "Seminar notes" plain "#+FILETAGS: seminar\n- title:\n- speaker:\n- event:\n- tags ::" ; 学术报告模板
           :target
           (file+head "seminar/%<%Y%m%d>-seminar-${slug}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n#+filetags: seminar"))))
  (require 'org-roam-dailies) 
  (org-roam-db-autosync-mode) ; 自动同步数据库
  (my/org-roam-refresh-agenda-list) ; 自动收集 project 文件中的待办事项
  (add-to-list 'org-after-todo-state-change-hook ; 将完成的待办事项备份至日记
               (lambda ()
                 (when (equal org-state "DONE")
                   (my/org-roam-copy-todo-to-today)))))

(use-package org-roam-ui
  :straight
  (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
  :defer t
  :after org-roam
  :custom
  (org-roam-ui-sync-theme t)
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t)
  (org-roam-ui-open-on-start t))

(use-package org-noter
  :defer t
  :straight (:host github
                   :repo "org-noter/org-noter"
                   :files ("*.el" "modules/*.el"))
  :bind
  (("C-c n n" . org-noter)
   :map org-noter-doc-mode-map
   ("M-e" . org-noter-insert-precise-note)
   ("e" . org-noter-insert-note))
  :custom
  (org-noter-highlight-selected-text t)
  (org-noter-notes-search-path '("~/repos/notes/ref/"))
  (org-noter-auto-save-last-location t)
  :config
  (if (> 999 (display-pixel-height)) 
      (setq org-noter-doc-split-fraction '(0.6 . 0.5))))

(use-package helm-bibtex
  :defer t
  :custom
  (bibtex-completion-notes-path org_notes)
  (bibtex-completion-bibliography zot_bib)
  (bibtex-completion-library-path zot_pdf))

(use-package org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :custom
  (orb-insert-interface 'helm-bibtex)
  (orb-insert-link-description 'citekey)
  (orb-preformat-keywords
   '("citekey" "title" "url" "author-or-editor" "keywords" "file"))
  (orb-process-file-keyword t)
  (orb-attached-file-extensions '("pdf")))

(add-hook 'org-roam-mode-hook 'visual-line-mode) ; 自动换行
