my-emacs-config/emacs-config.org
*** 基本函数与变量  
#+begin_src elisp
  (defvar my/org-roam-project-template ; 项目笔记模板
    '("p" "project" plain "** TODO %?"
      :if-new (file+head+olp "%<%Y%m%d%H>-${slug}.org"
                             "#+title: ${title}\n#+category: ${title}\n#+filetags: Project\n"
                             ("Tasks"))))
  (defun my/org-roam-filter-by-tag (tag-name) ; 按 tag 搜索笔记; 需要 lexical binding
    (lambda (node)
      (member tag-name (org-roam-node-tags node)))) 
  (defun my/org-roam-list-notes-by-tag (tag-name) ; 按 tag 显示笔记
    (mapcar #'org-roam-node-file
            (seq-filter
             (my/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))

#+end_src
*** 新增/查找项目
#+begin_src elisp
    (defun my/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
    capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun my/org-roam-insert-new-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Select a project file to open, creating it if necessary
    (org-roam-capture- :node (org-roam-node-read
                              nil
                              (my/org-roam-filter-by-tag "Project"))
                       :templates (list my/org-roam-project-template)))

  (defun my/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (my/org-roam-filter-by-tag "Project")))
#+end_src
把项目笔记加入 org-agenda 文件中
#+begin_src elisp
  (defun my/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))
#+end_src
*** 新增项目中的待办
#+begin_src elisp
    (defun my/org-roam-capture-task ()
    (interactive)
    ;; 新增项目后, 更新 org-agende 文件列表
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; 新增待办
    (org-roam-capture- :node (org-roam-node-read
                              nil
                              (my/org-roam-filter-by-tag "Project"))
                       :templates (list my/org-roam-project-template)))
#+end_src
*** 日记
月结/年终总结模板
  #+begin_src elisp
    (defun my/org-roam-goto-month ()
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y-%B")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("m" "month" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y-%B>.org"
                                                          "#+title: %<%Y-%B>\n#+filetags: Project\n")
                                       :unnarrowed t))))

    (defun my/org-roam-goto-year ()
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("y" "year" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y>.org"
                                                          "#+title: %<%Y>\n#+filetags: Project\n")
                                       :unnarrowed t))))
  #+end_src
Hydra 定义的日记界面
  #+begin_src elisp
    (defhydra my/org-roam-jump-menu (:hint nil)
      "
    ^Dailies^        ^Capture^       ^Jump^
    ^^^^^^^^-------------------------------------------------
    _t_: today       _T_: today       _m_: current month
    _r_: tomorrow    _R_: tomorrow    _e_: current year
    _y_: yesterday   _Y_: yesterday   ^ ^
    _d_: date        ^ ^              ^ ^
    "
      ("t" org-roam-dailies-goto-today)
      ("r" org-roam-dailies-goto-tomorrow)
      ("y" org-roam-dailies-goto-yesterday)
      ("d" org-roam-dailies-goto-date)
      ("T" org-roam-dailies-capture-today)
      ("R" org-roam-dailies-capture-tomorrow)
      ("Y" org-roam-dailies-capture-yesterday)
      ("m" my/org-roam-goto-month)
      ("e" my/org-roam-goto-year)
      ("c" nil "cancel"))
  #+end_src

*** 在日记中备份已完成待办
#+begin_src elisp
  (defun my/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ; Set this to nil to delete the original!
          (org-roam-dailies-capture-templates
            '(("t" "tasks" entry "%?"
               :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
          (org-after-refile-insert-hook #'save-buffer)
          today-file
          pos)
      (save-window-excursion
        (org-roam-dailies--capture (current-time) t)
        (setq today-file (buffer-file-name))
        (setq pos (point)))
      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
                     (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks" today-file nil pos)))))
#+end_src
** 即时加入空笔记的函数
#+begin_src elisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src
* 项目管理
** Magit
#+begin_src elisp
  (use-package magit
    :commands magit-status
    :autoload  magit-get-current-branch
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src
** Perspective 
#+begin_src elisp
  (use-package perspective
    :defer 2
    :bind (("C-M-k" . persp-switch)
           ("C-M-n" . persp-next)
           ("C-x k" . persp-kill-buffer*))
    :custom
    (persp-mode-prefix-key (kbd "C-x x"))
    :config
    (unless (equal persp-mode t)
      (persp-mode))
    (setq persp-state-default-file (expand-file-name ".persp-save" user-emacs-directory)))
#+end_src
* 编程语言
** 终端
#+begin_src elisp
  (use-package shell
    :defer t)
#+end_src

More colorful terminal
#+begin_src elisp
  (use-package eterm-256color
  :hook term-mode)
#+end_src
** 字幕编辑
#+begin_src elisp
  (use-package subed
    :straight
    (:host github :repo "sachac/subed" :files ("subed/*.el"))
    :config
    ;; Remember cursor position between sessions
    (add-hook 'subed-mode-hook 'save-place-local-mode)
    ;; Break lines automatically while typing
    (add-hook 'subed-mode-hook 'turn-on-auto-fill)
    ;; Break lines at 40 characters
    (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 100)))
    ;; Some reasonable defaults
    (add-hook 'subed-mode-hook 'subed-enable-pause-while-typing)
    ;; As the player moves, update the point to show the current subtitle
    (add-hook 'subed-mode-hook 'subed-enable-sync-point-to-player)
    ;; As your point moves in Emacs, update the player to start at the current subtitle
    (add-hook 'subed-mode-hook 'subed-enable-sync-player-to-point)
    ;; Replay subtitles as you adjust their start or stop time with M-[, M-], M-{, or M-}
    (add-hook 'subed-mode-hook 'subed-enable-replay-adjusted-subtitle)
    ;; Loop over subtitles
    (add-hook 'subed-mode-hook 'subed-enable-loop-over-current-subtitle)
    ;; Show characters per second
    (add-hook 'subed-mode-hook 'subed-enable-show-cps))
#+end_src

** python
#+begin_src elisp
  (use-package python-mode
      :defer t)
#+end_src
*** cython
#+begin_src elisp
  (use-package cython-mode
      :mode "\\.pyx\\'"
      :config
      (add-hook 'cython-mode-hook #'flycheck-mode))
#+end_src
*** elpy
follow suggestion from https://emacs.stackexchange.com/questions/10065/how-can-i-defer-loading-elpy-using-use-package to defer elpy mode
#+begin_src elisp
  (use-package elpy
      :defer t
      :config
      (advice-add 'python-mode :before 'elpy-enable)
      (setq elpy-modules
            '(elpy-module-company elpy-module-eldoc elpy-module-flymake elpy-module-pyvenv elpy-module-highlight-indentation elpy-module-yasnippet elpy-module-django elpy-module-sane-defaults)))
#+end_src
