my-emacs-config/emacs-config.org
** markdown
#+begin_src elisp
  (use-package markdown-mode
      :mode "\\.md\\'"
      :custom
      (markdown-command "pandoc -F pandoc-crossref -F pandoc-citeproc -f markdown -t html -s --mathjax")
      :config
      (add-to-list 'process-coding-system-alist '("pandoc" utf-8-dos . utf-8-dos))
      (add-hook 'markdown-mode-hook 'turn-on-cdlatex)
      (markdown-enable-math t))
#+end_src
** yaml
#+begin_src elisp
  (use-package yaml-mode
    :mode "\\.yml\\'")
#+end_src
* 邮件
** mu4e
#+begin_src elisp
  (when my/mu4e-enabled
    (use-package mu4e
      :straight (:local-repo "/usr/local/share/emacs/site-lisp/mu4e/"
                             :type nil :pre-build ())
      :defer 20 ; Wait until 20 seconds after startup
      :after evil-collection
      :config

      ;; This is set to 't' to avoid mail syncing issues when using mbsync
      (setq mu4e-change-filenames-when-moving t)
      ;; Refresh mail using isync every 10 minutes
      (setq mu4e-update-interval (* 5 60))
      (setq mu4e-get-mail-command "mbsync -a")
      (setq mu4e-maildir "~/Mail")
      (setq mu4e-maildir-shortcuts
            '(("/Hotmail/Inbox"             . ?i)
              ("/Gmail/[Gmail]/Sent Mail" . ?s)
              ("/Gmail/[Gmail]/Trash"     . ?t)
              ("/Gmail/[Gmail]/Drafts"    . ?d)
              ("/Gmail/[Gmail]/All Mail"  . ?a)))))
#+end_src
* 启动时间优化
** esup
#+begin_src elisp
  (use-package esup
    :defer t
    :config
    (setq esup-depth 0))
#+end_src
** 显示启动时间
#+begin_src elisp
  (defun efs/display-startup-time ()
      (message "Emacs loaded in %s with %d garbage collections."
               (format "%.2f seconds"
                       (float-time
                       (time-subtract after-init-time before-init-time)))
               gcs-done))
    (add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src
* 浏览器
** eww 界面优化
#+begin_src elisp
  (use-package shrface
    :defer t
    :after eww
    :config
    (shrface-basic)
    (shrface-trial)
    (shrface-default-keybindings) ; setup default keybindings
    (setq shrface-href-versatile t))
#+end_src
** 代码块
#+begin_src elisp
(use-package shr-tag-pre-highlight
  :after shr
  :config
  (add-to-list 'shr-external-rendering-functions
               '(pre . shr-tag-pre-highlight)))
#+end_src
** EWW 设置
#+begin_src elisp
  (use-package eww
    :defer t
    :custom
    (eww-retrieve-command nil)
    (eww-search-prefix "https://google.com/search?q=")
    (shr-use-fonts nil)
    :init
    (add-hook 'eww-after-render-hook #'shrface-mode)
    :config
    (add-hook 'eww-mode-hook 'visual-line-mode)
    (require 'shrface))
#+end_src
* 结束代码
#+begin_src elisp
  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src
