my-emacs-config/init.el

(use-package markdown-mode
    :mode "\\.md\\'"
    :custom
    (markdown-command "pandoc -F pandoc-crossref -F pandoc-citeproc -f markdown -t html -s --mathjax")
    :config
    (add-to-list 'process-coding-system-alist '("pandoc" utf-8-dos . utf-8-dos))
    (add-hook 'markdown-mode-hook 'turn-on-cdlatex)
    (markdown-enable-math t))

(use-package yaml-mode
  :mode "\\.yml\\'")

(when my/mu4e-enabled
  (use-package mu4e
    :straight (:local-repo "/usr/local/share/emacs/site-lisp/mu4e/"
                           :type nil :pre-build ())
    :defer 20 ; Wait until 20 seconds after startup
    :after evil-collection
    :config

    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)
    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 5 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")
    (setq mu4e-maildir-shortcuts
          '(("/Hotmail/Inbox"             . ?i)
            ("/Gmail/[Gmail]/Sent Mail" . ?s)
            ("/Gmail/[Gmail]/Trash"     . ?t)
            ("/Gmail/[Gmail]/Drafts"    . ?d)
            ("/Gmail/[Gmail]/All Mail"  . ?a)))))

(use-package esup
  :defer t
  :config
  (setq esup-depth 0))

(defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                     (time-subtract after-init-time before-init-time)))
             gcs-done))
  (add-hook 'emacs-startup-hook #'efs/display-startup-time)

(use-package shrface
  :defer t
  :after eww
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t))

(use-package shr-tag-pre-highlight
  :after shr
  :config
  (add-to-list 'shr-external-rendering-functions
               '(pre . shr-tag-pre-highlight)))

(use-package eww
  :defer t
  :custom
  (eww-retrieve-command nil)
  (eww-search-prefix "https://google.com/search?q=")
  (shr-use-fonts nil)
  :init
  (add-hook 'eww-after-render-hook #'shrface-mode)
  :config
  (add-hook 'eww-mode-hook 'visual-line-mode)
  (require 'shrface))

(setq gc-cons-threshold (* 2 1000 1000))
